app/controllers/movies_controller.rb

  def index
    @all_ratings=['G','PG','PG-13','R']
    @order_by=params[:order_by]
    if params[:ratings]
      @s_ratings=params[:ratings].keys
    else
      @s_ratings=@all_ratings
    end
    @movies = Movie.find(:all,:conditions =>{:rating =>  @s_ratings},:order => @order_by)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "movies" SET "updated_at" = '2013-08-14 18:29:54.440599', "rating" = 'PG' WHERE "movies"."id" = 5